const book = [
  {
    title: "มุมมองนักอ่านพระเจ้า เล่ม 1",
    author: "sing N song",
    publisher: "Levon",
    description:
      "คิมดกจา หนุ่มพนักงานออฟฟิศธรรมดาๆ เขาเป็นเเฟนคลับของนักเขียนคนหนึ่งซึ่งนิยายออนไลน์เรื่องนี้ดำเนินเรื่องมาสิบปีแล้ว และแฟนๆก็เลิกติดตามเลิกอ่านนิยายเรื่องนี้ไปแล้ว แต่มีเขาเพียงคนเดียวที่ยังติดตามนิยายเรื่องนี้อยู่ ระหว่างที่กำลังอยู่บนรถไฟฟ้านักเขียนได้อัปเดตนิยายและแจ้งว่าเขาจะลงตอนจบของนิยาย หลังจากที่คิมดกจาได้อ่านตอนจบแล้วนักเขียนก็ส่งข้อความมาหาตัวเขา ซึ่งคือสามวิธีเอาตัวรอดในโลกนิยายของนักเขียน หลังจากนั้นรถไฟที่คิมดกจานั่งก็ทะลุมิติข้ามไปในโลกนิยายเรื่องนี้ ดังนั้นการเอาตัวรอดในโลกที่กำลังล่มสลายจึงเริ่มขึ้น",
    image: "./img/orv1.png",
    price: 295.0,
  },
  {
    title: "มุมมองนักอ่านพระเจ้า เล่ม 2",
    author: "sing N song",
    publisher: "Levon",
    description:
      "[ สามวิธีการเอาชีวิตรอดในโลกที่ล่มสลาย ] คือชื่อของนิยายออนไลน์กว่าสามพันตอนที่มีเขาเป็นผู้อ่านแค่ ‘คนเดียว’ เขารู้เรื่องราวทั้งหมดของมัน รู้ว่าแต่ละฉากจะดำเนินไปแบบไหน และรู้ว่าเรื่องนี้จะจบลงอย่างไร ดังนั้น…เมื่อจู่ๆ โลกใบนี้ก็เปลี่ยนไป กลายเป็นเหมือนกับในนิยาย ท่ามกลางความหายนะต่างๆ นานา และ ‘ซีนาริโอ’ ที่เข้ามาท้าทายเหล่ามนุษย์ คิมดกจาจึงรู้ดีว่าจะผ่านเงื่อนไขแต่ละฉากไปได้ด้วยวิธีไหน แต่การ ‘รู้’ กับการ ‘ทำได้จริง’ ก็เป็นคนละเรื่องกัน โลกเปลี่ยนแปลงไปแล้ว และนิยายที่เคยมีเขาเป็นผู้อ่านเพียงหนึ่งเดียวจนถึงบทสุดท้าย ก็ค่อยๆเปลี่ยนแปลงไปเพราะมีเขาเข้ามาเป็นตัวแปรเช่นกัน ปฐมบทของนิยายเรื่องนี้เริ่มขึ้นแล้วคุณล่ะ…พร้อมเข้าไปในนิยายเรื่องนี้แล้วหรือยัง",
    image: "./img/orv2.png",
    price: 275.0,
  },
  {
    title: "มุมมองนักอ่านพระเจ้า เล่ม 3",
    author: "sing N song",
    publisher: "Levon",
    description:
      "“ถ้าไม่มั่นใจว่าตัวเองจะแข็งแกร่งได้ขนาดที่ไม่มีใครกล้ามาทำร้าย ก็ต้องเริ่มจากการสร้างสหายที่เชื่อใจได้ซะ” เมื่อคิมดกจาเดินทางมาถึงซีนาริโอที่ 5 เป็นที่เรียบร้อย พร้อมกับปริศนาของยูจุงฮยอก ที่ทำเอาคิมดกจาสับสนขึ้นเรื่อยๆ หรือในครั้งนี้เขาต้องเผชิญหน้ากับ #ยูจุงฮยอก จริงๆ! นอกจากคิมดกจาแล้ว ยังมี ‘นักอ่าน’ คนอื่นๆอีก น่าแปลก เพราะในนิยายต้นฉบับ ไม่ว่าจะในการย้อนกลับรอบไหนก็ไม่เคยมีข้อมูลเกี่ยวกับคนพวกนี้อยู่เลย เพื่อที่จะสืบหาตัวตนที่แท้จริงและจุดประสงค์เบื้องหลัง คิมดกจาจึงอ้างตนเป็น #ยูจุงฮยอก ผู้เป็นดั่งพระเจ้าในสายตาคนเหล่านี้ จนได้รับเชิญให้เข้าร่วมใน‘ค่ำคืนของเหล่านักพยากรณ์’ โดยหารู้ไม่ว่า นั่น…คือกับดัก!",
    image: "./img/orv3.png",
    price: 275.0,
  },
  {
    title: "มุมมองนักอ่านพระเจ้า เล่ม 4",
    author: "sing N song",
    publisher: "Levon",
    description:
      "สมาชิกกลุ่มกระจัดกระจายกันไปใน ‘โลกที่ไร้ราชา’ แต่คนแรกที่คิมดกจาได้เจอแทนที่จะเป็นเพื่อนคนใดคนหนึ่งกลับกลายเป็นยัยนักเขียนขี้ก๊อปนั่นซะได้ คู่กัดเลยต้องจับมือกันชั่วคราว เตรียมความพร้อมสู่ซีนาริโอถัดไป ซึ่งครอบคลุมพื้นที่ขนาดใหญ่ที่สุดเท่าที่เคยมีมา นั่นคือทั้งกรุงโซล! หนึ่งใน ‘ภัยพิบัติ’ ที่พวกเขาต้องขัดขวางร้ายกาจจนแม้แต่ยูจุงฮยอกก็ยังต้องพ่ายและเกือบตายในการย้อนกลับรอบที่ 3 แต่หนนี้จะต่างออกไปแน่เพราะมีตัวแปรอย่างคิมดกจาเข้ามาอย่างไรล่ะ",
    image: "./img/orv4.png",
    price: 275.0,
  },
  {
    title: "มุมมองนักอ่านพระเจ้า เล่ม 5",
    author: "sing N song",
    publisher: "Levon",
    description:
      "ภัยพิบัติแห่งอุทกภัยที่ถล่มกรุงโซลได้ในเวลาไม่ถึงชั่วโมง ทว่าคิมดกจากลับเลือกที่จะไม่กำจัดเธอ หนำซ้ำยังรับเธอมาเป็น ‘อวตาร’ ของตัวเองอีกต่าง หากจริงอยู่ว่าเขาไม่ใช่กลุ่มดาว แต่เรื่องให้การสนับสนุนอวตาร เขาทำได้ดีกว่ากลุ่มดาวบางกลุ่มแน่นอน เด็กน้อยชินยูซึงคนนี้จะเติบโตไปเป็นเจ้าแห่งสัตว์อสูร เขาจำเป็นต้องมีเธออยู่ข้างกายเพื่อไปให้ถึงฉากจบของเรื่องราวทั้งหมดที่เขาอยากเห็น",
    image: "./img/orv5.png",
    price: 275.0,
  },
  {
    title: "มุมมองนักอ่านพระเจ้า เล่ม 6",
    author: "sing N song",
    publisher: "Levon",
    description:
      "เพื่อช่วยหญิงสาวจากการย้อนกลับรอบที่ 41 คิมดกจาจึงรับภารกิจกลับมาจากราชินีแห่งดินแดนยมโลก ภารกิจแบบเดียวกับวีรบุรุษเฮอร์คิวลีสในตำนาน…การปราบอสรพิษ! ภารกิจลับกับซีนาริโอใหม่ดำเนินไปควบคู่กัน ณ ดินแดนอื่นที่ไม่ใช่โลกมนุษย์ หนนี้บทบาทของพวกเขากลับตาลปัตร จากผู้รับมือภัยพิบัติ กลับต้องกลายมาเป็นภัยพิบัติต่อเผ่าพันธุ์อื่นเสียเอง!",
    image: "./img/orv6.png",
    price: 275.0,
  },
  {
    title: "มุมมองนักอ่านพระเจ้า เล่ม 7",
    author: "sing N song",
    publisher: "Levon",
    description:
      "[คุณคืออวตารที่แข็งแกร่งที่สุดของโดมกรุงโซลในปัจจุบัน] เมื่อความแข็งแกร่งของอวตารตัดสินจากระดับความยากของเรื่องเล่าที่สั่งสมมา งั้นคิมดกจาจะแข็งแกร่งที่สุดก็ถูกต้องแล้ว ซึ่งเท่ากับว่าการยอมสละชีพของเขาจะปกป้องกรุงโซลได้ เขาเพิ่งจะได้รับคุณลักษณะ ‘แปดชีวิต’ มา ตายไปสักครั้งก็ไม่มีปัญหาอะไร เพียงแต่การประลองระหว่างยูจุงฮยอกกับผู้กลับชาตินั่นคงต้องยื่นมือเข้าไปยุ่งเสียหน่อย หมอนั่นยิ่งแพ้ทางอีกฝ่ายอยู่ด้วย เกิดยูจุงฮยอกพลาดท่าถูกฆ่า แล้วทำโลกย้อนกลับ นั่นไม่ดีสำหรับเขาแน่!",
    image: "./img/orv7.png",
    price: 265.0,
  },
  {
    title: "มุมมองนักอ่านพระเจ้า เล่ม 8",
    author: "sing N song",
    publisher: "Levon",
    description:
      "คิมดกจาไปจาก ‘สรวงสวรรค์’ ได้หลายวันแล้ว เขาตั้งใจจะให้สมาชิกกลุ่มลองเผชิญกับซีนาริโอกันเอาเอง แต่คิดไม่ถึงว่ายูจุงฮยอกจะมาโผล่ที่นั่นด้วย ลองว่าตัวเอกออกโรงเองแบบนี้ก็การันตีความปลอดภัยของสมาชิกกลุ่มได้แล้ว แต่ความปลอดภัยของตัวเขานี่สิกลับสุ่มเสี่ยง เมื่อข้อความแห่งโชคชะตาดังย้ำๆ อยู่นั่นแหละว่า...[อวตารคิมดกจาจะต้องตายด้วยเงื้อมมือของคนที่รักที่สุด] จนเกิดเป็นเรื่องราววุ่นวาย เพราะไม่ว่าจะอวตารหรือกลุ่มดาวล้วนอยากรู้กันจะแย่ว่าคนที่คิมดกจารักที่สุดคือใครกัน",
    image: "./img/orv8.png",
    price: 255.0,
  },
  {
    title: "มุมมองนักอ่านพระเจ้า เล่ม 9",
    author: "sing N song",
    publisher: "Levon",
    description:
      "ตำแหน่ง ‘ราชาปีศาจอันดับที่ 73’ ตกเป็นของคิมดกจา ตามด้วยการที่เขาเสียสละชีวิตตัวเองอีกครั้ง [ร่างอวตารของคุณดับสูญโดยสมบูรณ์] [คุณล้มเหลวในการดำเนินซีนาริโอ] [คุณถูกเนรเทศออกจากซีนาริโอ] ร่างกายไม่มีแล้ว โลกให้กลับไปก็ไม่มีด้วย สิ่งที่ต้องทำตอนนี้คือการหาซีนาริโอแล้วเข้าไปดำเนินเรื่องราวให้ได้ ไม่งั้นแม้แต่ดวงวิญญาณเขาก็รักษาไว้ไม่อยู่ และดูเหมือนว่ามีเพียงสถานที่เดียวที่เขาสามารถมุ่งหน้าไป...โลกปีศาจที่ 73 สถานที่ซึ่งแทบจะไม่มีกลุ่มดาว นักเล่าเรื่อง และความหวังใดๆ",
    image: "./img/orv9.png",
    price: 265.0,
  },
  {
    title: "มุมมองนักอ่านพระเจ้า เล่ม 10",
    author: "sing N song",
    publisher: "Levon",
    description:
      "‘ความเผด็จการ’ และ ‘ผู้สูญเสีย’ นั้นมักจะมาคู่กันเสมอ เหมือนกับซีนาริโอนักปฏิวัติที่คิมดกจากำลังเผชิญอยู่ หรือช่วงเวลาของศึกเลือกราชาปีศาจจะใกล้เข้ามาแล้ว แล้วศึกครั้งนี้นั้นจะส่งผลอะไรแก่ซีนาริโอที่กำลังเผชิญอยู่ ในครั้งนี้ “คิมดกจา” ต้องเป็นคนตัดสินใจเองว่าจะร่วมมือกับราชาปีศาจหรือไม่! เขาจะเลือกอะไร เส้นทางต่อไปของ “พวกเขา” คืออะไรกันแน่",
    image: "./img/orv10.png",
    price: 265.0,
  },
];
const bookContainer = (document.getElementById("book-container").innerHTML =
  book
    .map(
      (
        item,
        index
      ) => `<div key=${index} class="border rounded-lg shadow-lg bg-white px-4 py-2 h-full flex flex-col justify-between mx-auto max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg">
    <div class="flex justify-center">
        <img class="object-cover w-32 h-40 sm:w-40 sm:h-52 md:w-48 md:h-60 rounded-lg mb-4" src="${
          item.image
        }" alt="${item.title}">
    </div>
    
    <div class="px-2 ">
        <p class="text-primary font-bold text-md sm:text-lg mb-1 hover:underline cursor-pointer" onclick="showDetails(${index})">${
          item.title
        }</p>
        <p class="text-xs sm:text-sm text-gray-600 mb-2">${item.author}</p>
        <p class="text-gray-800 text-xs sm:text-sm mb-2">${item.description.slice(
          0,
          60
        )}...</p>
        
        <div class="flex items-center mb-2">
            <i class="ri-star-fill text-yellow-500"></i>
            <p class="text-primary text-xs sm:text-sm ml-2">(${item.rating})</p>
        </div>

        <p class="text-primary font-semibold text-sm sm:text-lg mb-2">ราคา ${
          item.price
        } บาท</p>
    </div>

    <div class="flex flex-col space-y-2">
        <div class="flex justify-center space-x-2 mt-2">
            <button class="bg-primary text-white rounded-full px-2 sm:px-3 py-1 sm:py-2 text-xs sm:text-sm flex items-center hover:bg-purple-700 transition-colors duration-200">
                <i class="ri-shopping-cart-fill mr-1"></i> เพิ่มลงตะกร้า
            </button>
            <div class="flex items-center cursor-pointer text-primary hover:text-red-500 transition-colors duration-200">
                <i class="ri-heart-line text-base sm:text-lg mr-1"></i>
                <p class="text-xs sm:text-sm">เพิ่มลงรายการโปรด</p>
            </div>
        </div>
    </div>
</div>
`
    )
    .join(""));

    function showDetails(index) {
      const bookDetail = book[index];
    
      const params = new URLSearchParams({
        title: bookDetail.title,
        author: bookDetail.author,
        publisher: bookDetail.publisher,
        description: bookDetail.description,
        image: bookDetail.image,
        price: bookDetail.price,
      });
      const Url = `detail.html?${params}`;
      window.location.href = Url;
    }
    