const book = [
  {
    title: "เขาบอกว่าบ้านนี้มีฆาตกรThe Only One Left",
    author: "Riley Sager",
    publisher: "น้ำพุ",
    description:
      "ตอนอายุ 17 พวกเด็กสาวเล่นสนุกกัน ส่วน “เลนอรา โฮป” ฆ่าทุกคนในบ้านตัวเอง  คฤหาสน์เก่าแก่ที่ตั้งโดดเดี่ยวบนหน้าผาสูงชัน เคยเกิดเหตุฆ่ายกครัวเมื่อ 54 ปีก่อน ทุกคนในบ้านกลายเป็นศพ ยกเว้นเลนอรา ขณะเกิดเหตุไม่มีคนอื่นอยู่ด้วย แล้วคนลงมือจะเป็นใครได้ถ้าไม่ใช่คนที่รอด เลนอราไม่เคยถูกดำเนินคดีเพราะไม่มีหลักฐานเอาผิด นับแต่นั้นเธอก็เก็บตัวอยู่ในคฤหาสน์ หลบซ่อนจากสายตาผู้คน ท่ามกลางปริศนาฆาตกรรมที่ยังคลุมเครือว่า “บ้านหลังนี้มีฆาตกร” ปัจจุบันเลนอราเป็นเพียงหญิงชราไร้พิษสง ร่างกายเป็นอัมพาตแถมพูดไม่ได้ แต่เมื่อพยาบาลที่ดูแลเธอหายตัวไปอย่างลึกลับ ไร้ร่องรอย ไร้หลักฐาน ไร้ผู้พบเห็น ข่าวลือว่า “บ้านหลังนี้มีฆาตกร” จึงโหมกระพือขึ้นมาอีกครั้ง และมันจะไม่ดับลงจนกว่าจะมีการเปิดเผยความจริง... ความจริงอันน่าขนลุกที่ถูกซุกซ่อนไว้มานานกว่าครึ่งศตวรรษ!",
    image: "./novel/Riley.png",
    price: "297.50",
  },
  {
    title: "บ้านวิกลคนประหลาด เล่ม 2",
    author: "อุเก็ตสึ (Uketsu)",
    publisher: "Bibli (บิบลิ)",
    description:
      " ผังบ้านหลังนี้มีอะไรแปลก ๆ ฉันเขียนหนังสือชื่อ “บ้านวิกลคนประหลาด” ว่าด้วยผังบ้านแปลก ๆ ซึ่งนำไปสู่การค้นพบเหตุการณ์น่าสะพรึง หลังจากมีคนจำนวนมากได้อ่าน ก็มีคนส่งข้อมูลเกี่ยวกับ “บ้าน” มาให้ฉันมากมายโถงทางเดินไร้ปลายทางบ้านที่หล่อหลอมความมืดบ้านกับดักหนูอะพาร์ตเมนต์ไร้ทางหนีห้องที่เคยโผล่มาแค่ครั้งเดียวในบรรดาข้อมูลและเอกสารเหล่านั้น มีบ้าน 11 หลังที่ดูเผิน ๆ ไร้ซึ่งความเกี่ยวข้องกันโดยสิ้นเชิง แต่เมื่อตั้งใจอ่านกลับพบความเชื่อมโยงอย่างหนึ่งบรรดาบ้านประหลาดที่สร้างขึ้นในภูมิภาคชูบุ ความจริงที่ถูกฝังในความมืดซึ่งผ่านกาลเวลามายาวนาคืออะไรกันแน่การกลับมาของ “บ้านวิกลคนประหลาด” นิยายสืบสวนสั่นประสาทชื่อดังที่เป็นไวรัลในอินเทอร์เน็ต การันตีด้วยยอดขายกว่า 1 ล้านเล่มและได้รับการนำไปสร้างเป็นภาพยนตร์ญี่ปุ่น",
    image: "./novel/Uketsu.png",
    price: "373.15",
  },
  {
    title: "บ้านวิกลคนประหลาด",
    author: "อุเก็ตสึ (Uketsu)",
    publisher: "Bibli (บิบลิ)",
    description:
      "ความลับชวนขนลุกของบ้านธรรมดาหลังหนึ่ง ความบิดเบี้ยวที่จะปลุกเร้าจินตนาการสุดดำมืดของคุณ นิยายดังที่เป็นกระแสไวรัลในโลกออนไลน์",
    image: "./novel/Uketsu1.png",
    price: "225.25",
  },
  {
    title: "ฆาตกรมนุษย์กบกับศพปริศนา ถึงเวลาออกฆ่าอีกครั้ง",
    author: "ชิจิริ นากายามะ (Shichiri Nakayama)",
    publisher: "prism publishing , ปริซึม",
    description:
      "เมื่อ “มนุษย์กบ” คนเดิมถูกจับไปแล้ว แล้วครั้งนี้ใครคือฆาตกรกันแน่!!!",
    image: "./novel/Shichiri.png",
    price: "335.75",
  },
  {
    title: "ฆาตกรรมชำนาญ More Forensics and Fiction",
    author: "D.P.Lyle (ดี.พี.ไลล์)",
    publisher: "storyard",
    description:
      "เคยสงสัยมั้ยว่าคนเรามีชีวิตอยู่ในตู้แช่แข็งได้นานแค่ไหน?พิษงูที่อยู่ในผลไม้จะทำให้เราเสียชีวิตได้หรือไม่? เม็ดทรายบนชายหาดจะช่วยไขปริศนาของคดีฆาตกรรมได้อย่างไร?การตรวจดีเอ็นเอจะบอกได้หรือไม่ว่าผู้เสียชีวิตเป็นแวมไพร์? หากคุณเคยสงสัย คุณหมอ ดี. พี. ไลล์ จะช่วยตอบคำถามเหล่านี้และคำถามอื่นๆ อีกมากมายที่ส่งมาจากนักเขียนนวนิยายและบทภาพยนตร์/บทละครทั่วโลกนอกจากความรู้ทางการแพทย์ หนังสือเล่มนี้ยังเต็มไปด้วยจินตนาการอันล้นเปี่ยมของนักเล่าเรื่องทีต้องการให้เรื่องที่เล่านั้นตื่นเต้นน่าติดตามและถูกต้องตามความเป็นจริง'ฆาตกรรมชำนาญ' - คุณหมอ ดี. พี. ไลล์ จะพาคุณไปพบกับเรื่องราวทางการแพทย์และการสืบสวสอบสวนที่เพลิดเพลินชวนขบคิด และไม่แน่ มันอาจจะจุดประกายเรื่องเล่าของตัวคุณเองก็เป็นได้",
    image: "./novel/D.P.Lyle.png",
    price: "446.00",
  },
  {
    title: "ปาฏิหาริย์ร้านชำของคุณนามิยะ โดย ฮิงาชิโนะ เคโงะ",
    author: "ฮิงาชิโนะ เคโงะ (Keigo Higashino)",
    publisher: "น้ำพุ",
    description:
      "ปาฏิหาริย์ร้านชำของคุณนามิยะ นิยายแปล หนังสือขายดี โดย ฮิงาชิโนะ เคโงะ บอกเล่าเรื่องราวของหัวขโมย 3 คน ที่หลงเข้าไปใน ร้านชำของคุณนามิยะ",
    image: "./novel/Higashino.png",
    price: "250.75",
  },
  {
    title: "ฆาตกรมนุษย์กบกับศพปริศนา",
    author: "ชิจิริ นากายามะ (Shichiri Nakayama)",
    publisher: "prism publishing , ปริซึม",
    description:
      " โคเทกาวะ คาสึยะ ตำรวจฝ่ายสืบสวน และ หัวหน้าของเขา สารวัตรวาตาเสะ ผู้เป็นหัวหน้าแผนกสอบสวนที่หนึ่งของกรมตำรวจไซตามะทำการสืบสวนคดีฆาตกรรมต่อเนื่องจำนวน 4 ศพ โดยมีชื่อและลักษณะการเสียชีวิตดังนี้ 1.อะราโอะ เรโกะ พนักงานบริษัท สภาพศพถูกแขวนด้วยตะขอ พบข้อความในเศษกระดาษอยู่ข้างๆศพแรก เขียนด้วยลายมือขีดเขี่ยเหมือนเด็กว่า 'วันนี้จับกบได้ด้วยแหละ เอาใส่ไว้ในกล่องแล้วก็เล่นกับมันเยอะเลย แต่ก็เริ่มเบื่อซะแล้ว นึกออกแล้ว..ลองทำให้มันเป็นเหมือนผีเสื้อดีกว่า เอาเข็มไปติดที่ปากแล้วเอาไปแขวนไว้ที่สูงสูงละกัน' 2.อิบุสุคิ เซ็นคิชิ ชายชรา ร่างถูกบด 3. อุโดอุ มาซาโตะ นักเรียนประถม ถูกหั่นศพ 4.เอะโตอุ คาสึโยชิ ทนายความ ร่างถูกเผา จากข้อความที่ฆาตกรทิ้งไว้ ทำให้สื่อตั้งฉายาให้ว่า 'มนุษย์กบ'",
    image: "./novel/Shichiri1.png",
    price: "318.75",
  },
  {
    title: "คดีฆาตกรรมในบ้านสิบเหลี่ยม",
    author: "อายาสึจิ ยูกิโตะ (Yukito Ayatsuji)",
    publisher: "แพรวสำนักพิมพ์",
    description:
      "หนังสือแปล ขายดี นิยายสืบสวนสอบสวน แนวลึกลับ คดีฆาตกรรมในบ้านสิบเหลี่ยม นักศึกษาเจ็ดคน ในบ้านบนเกาะร้างที่ซ่อนความลับทุกอย่างเอาไว้",
    image: "./novel/Yukito.png",
    price: "250.75",
  },
  {
    title: "ภาพวาดปริศนากับการตามหาฆาตกร",
    author: "อุเก็ตสึ (Uketsu)",
    publisher: "prism publishing , ปริซึม",
    description:
      "สี่เรื่องราวจากภาพวาดที่ยากจะคาดเดา • หญิงสาวที่เสียชีวิตจากการคลอดลูก เหลือไว้เพียงปริศนาจากภาพวาดห้าชิ้น ที่ไม่มีใครแก้ปริศนาได้ (ภาพที่ 1) • เด็กชายที่วาดรูปตนกับแม่ ยืนอยู่ข้างอพาร์ตเมนต์ที่อยู่อาศัย แต่บริเวณห้องกลับมีหมอกดำปกคลุมอยู่ (ภาพที่ 2) • ครูสอนศิลปะที่เสียชีวิตบนหุบเขา พร้อมกับภาพวาดบนหุบเขาชั้นแปดที่ทุกคนต่างถามว่า วาดทำไม (ภาพที่ 3) • เด็กหญิงที่วาดรูปบ้านและต้นไม้ ภายในต้นไม้มียกเขาชวาอาศัยอยู่ เพระเธออยากปกป้องคนที่อ่อนแอ (ภาพที่ 4) ทั้งสี่เรื่องคือปริศนาที่ให้คนอ่านได้มาขบคิดถึงความวิปริต วิปลาสในจิตใจคน จากภาพวาดที่คาดไม่ถึงว่าจะมีความลับอะไรซ่อนอยู่ในนั้น",
    image: "./novel/Uketsu2.png",
    price: "284.75",
  },
  {
    title: "เสียงกระซิบสีแดงฉาน",
    author: "อายาสึจิ ยูกิโตะ (Yukito Ayatsuji)",
    publisher: "prism publishing , ปริซึม",
    description:
      "เมื่อเด็กสาวคนหนึ่งตายในห้องต้องห้าม ความลับที่ไม่มีใครอยากบอก กับการตามหาโฉมหน้าของฆาตกรตัวจริง",
    image: "./novel/Yukito1.png",
    price: "284.75",
  },
];

const bookContainer = document.getElementById("book-container");
bookContainer.innerHTML = book
  .map(
    (item, index) => `
    <div key="${index}" class="border rounded-lg shadow-lg bg-white px-4 py-2 h-full flex flex-col justify-between mx-auto max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg">
        <div class="flex justify-center">
            <img class="object-cover w-32 h-40 sm:w-40 sm:h-52 md:w-48 md:h-60 rounded-lg mb-4" src="${
              item.image
            }" alt="${item.title}">
        </div>
        <div class="px-2 ">
            <p class="text-primary font-bold text-md sm:text-lg mb-1 hover:underline cursor-pointer" onclick="showDetails(${index})">${
      item.title
    }</p>
            <p class="text-xs sm:text-sm text-gray-600 mb-2">${item.author}</p>
            <p class="text-gray-800 text-xs sm:text-sm mb-2">${item.description.slice(
              0,
              60
            )}...</p>
            <div class="flex items-center mb-2">
                <i class="ri-star-fill text-yellow-500"></i>
                <p class="text-primary text-xs sm:text-sm ml-2">(${
                  item.rating
                })</p>
            </div>
            <p class="text-primary font-semibold text-sm sm:text-lg mb-2">ราคา ${
              item.price
            } บาท</p>
        </div>
        <div class="flex flex-col space-y-2">
            <div class="flex justify-center space-x-2 mt-2">
                <button 
                onclick="addToCart(${index})"
                class="bg-primary text-white rounded-full px-2 sm:px-3 py-1 sm:py-2 text-xs sm:text-sm flex items-center hover:bg-purple-700 transition-colors duration-200">
                    <i class="ri-shopping-cart-fill mr-1"></i> เพิ่มลงตะกร้า
                </button>
                <div class="flex items-center cursor-pointer text-primary hover:text-red-500 transition-colors duration-200">
                    <i class="ri-heart-line text-base sm:text-lg mr-1"></i>
                    <p class="text-xs sm:text-sm">เพิ่มลงรายการโปรด</p>
                </div>
            </div>
        </div>
    </div>
`
  )
  .join("");

function showDetails(index) {
  const bookDetail = book[index];

  const params = new URLSearchParams({
    title: bookDetail.title,
    author: bookDetail.author,
    publisher: bookDetail.publisher,
    description: bookDetail.description,
    image: bookDetail.image,
    price: bookDetail.price,
  });
  const Url = `detail.html?${params}`;
  window.location.href = Url;
}
