const book = [
  {
    title: "อาหารไทย ภาคกลาง",
    author: "กองบรรณาธิการแสงแดด",
    publisher: "แสงแดด/sangdad",
    description:
      "คำอธิ  ภาคกลางเป็นแหล่งลุ่มแม่น้ำ ดินดี น้ำซุ่ม จึงเป็นเขตที่มีความมั่งคั่งจากทรัพยากร ทั้งในน้ำและบนฝั่ง เป็นที่ตั้งของเมืองหลวงและเมืองสำคัญในปริมณฑล เป็นที่อยู่อาศัยของเจ้านายทั้งหลายจึงเป็นแหล่งรวมอาหารการกินที่มีการประดิดประดอยมากมาย ทั้งอาหารคาว อาหารหวาน อาหารว่างลักษณะอาหารภาคกลางที่โดดเด่นคือมีรสที่กลมกล่อม เป็นรสกลางๆ ไม่หนักไปข้างใดข้างหนึ่งมากจนเกินไป มีความละเมียดละไมในการปรุงแต่ง ทั้งนี้เพราะแหล่งอาหารไทยภาคกลางมาจากครัวในวังหลายต่อหลายจาน ครัวในวังนี่เองเป็นแหล่งที่นำอาหารพื้นบ้านมาปรับปรุงแต่งตัวเสียใหม่ให้เข้ากับวัฒนธรรมคนในวัง เช่น ส้มตำภาคอีสานบาย",
    image: "./img/beer1.jpg",
    price: 174.25,
  },
  {
    title: "อาหารเจจานเด็ด",
    author: "บุปผา กิตติกุล",
    publisher: " แสงแดด/sangdad",
    description:
      "  การรับประทานอาหารเจ เปรียบเสมือนการถือศีลอย่างหนึ่งเพราะไม่เบียดเบียนชีวิตผู้อื่น การปรุงอาหารเคร่งครัดมาก และมีของต้องห้ามสำหรับการปรุง สำหรับบางคนการกินอาหารเจอาจทำได้ยากเพราะยังติดในรสชาติความอร่อยและภาพลักษณ์ซึ่งดูไม่ชวนกินนัก ทว่าแท้จริงแล้วการกินอาหารเจนั้นได้ทั้งประโยชน์ต่อสุขภาพและมีผลดีต่อจิตใจอาหารเจให้สารอาหารครบถ้วน เน้นโปรตีนที่ได้จากถั่วเมล็ดแห้ง งา เห็ดต่างๆ เต้าหู้ และฟองเต้าหู้รวมถึงผักสารพัดชนิด จริงๆแล้วอาหารเจทำให้อร่อยได้ไม่ยาก ง่ายๆคือควรนึกถึงเครื่องปรุงทุกชนิด ตลอดจนน้ำซอสปรุงรส ต้องสดใหม่ สะอาด รสชาติดี เพียงเท่านี้อาหารเจจานไหนๆก็อร่อยอร่อย ประหยัด อาหารเจจานเด็ด เล่มนี้รวบรวมความอร่อยหลากหลาย เช่น ของว่าง สลัด เครื่องจิ้มจานเดียว ผัด ทอด อบ ตลอดจนแกง ต้ม นึ่ง ทุกสูตรปรุงง่าย สะดวก ราคาไม่แพงนัก และอร่อยถูกปากทั้งคนนิยมกินเจและผู้เริ่มกินเจ",
    image: "./img/beer2.jpg",
    price: 174.25,
  },
  {
    title: "อาหารตามสั่ง",
    author: "กองบรรณาธิการแสงแดด",
    publisher: " แสงแดด/sangdad",
    description:
      "  รวมสารพัดเมนูจานเด็ดอาหาตามสั่งต่างๆ ไว้มากมาย โดยในเล่มได้ให้รายละเอียดของเครื่องปรุง ส่วนประกอบและวิธีทำโดยละเอียด พร้อมภาพตัวอย่างประกอบชัดเจน ไม่ว่าจะเป็น อาหารตามสั่งคลาสสิก ได้แก่ ผัดกะเพราหมูสับ ผัดคะน้าหมูกรอบ ข้าวผัดหมู ฯลฯ อาหารตามสั่งรสไทย ได้แก่ ผัดเผ็ดปลาพริกสด ผักบุ้งผัดกะปิ ผัดน้ำพริกเผา ฯลฯ อาหารตามสั่งสมัยใหม่ ได้แก่ ไข่เยี่ยวม้ากะเพรากรอบ ผัดมะกะโรนี หน่อหม้ฝรั่งผัดกุ้งและอื่นๆ อีกมากมายในเล่ม สำหรับผู้ที่ชื่นชอบการทำอาหารทุกท่าน ที่สรรหาเมนูอร่อยไว้ทำทานเอง หรือเป็นอาชีพ พร้อมด้วยภาพประกอบสีสันสวยงาม ผู้ที่ชอบทำอาหารไม่ควรพลาดหนังสือเล่มนี้",
    image: "./img/beer3.jpg",
    price: 250.75,
  },
  {
    title: "เมนูเด็ด...อาหารจานเดียว (พิมพ์ครั้งที่ 3)",
    author: "พิมพ์วิชญ์ โภคาสุวิบุลย์",
    publisher: "เพชรประกาย/phetpraguy",
    description:
      "หนังสืออาหารจานเดียว เล่มนี้ มีสูตรอาหารจานเดียวมากมายถึง 54 เมนู ให้ได้ลิ้มลอง ฝึกปรือฝีมืออย่างไม่รู้เบื่อ หรือจะฝึกปรือไว้ เป็นอาชีพทางเลือกก็ยังได้ สูตรต่างๆ ในเล่มชัดเจนทำง่าย",
    image: "./img/beer4.jpg",
    price: 169.15,
  },
  {
    title: "พ่อครัวฝึกหัดกับคาจิกิอาหารศักดิ์สิทธิ์ เล่ม 1",
    author: "SUZUKI SANAMI",
    publisher: "สยามอินเตอร์คอมิกส์/Siam Inter Comics",
    description:
      "  นับตั้งแต่อดีต มีสัตว์ประหลาดที่เรียกว่า อยู่ในประเทศแห่งนี้ คาจิกิมีรูปลักษณ์อันน่าสะพรึงกลัวแต่กลับมีพลังอันน่าประหลาด ทั้งยังอร่อยล้ำเกินบรรยาย พ่อครัวฝึกหัด เพื่อช่วยเหลืออิซะเพื่อนสมัยเด็กที่ถูกคาจิกิเข้าทำร้าย จึงได้เข้าเผชิญหน้ากับวัตถุดิบชั้นยอด!การต่อสู้อันไร้ขอบเขตเพื่ออาหารรสเลิศแบบฉบับญี่ปุ่นได้เริ่มเปิดฉากแล้ว!",
    image: "./img/beer5.jpg",
    price: 85.5,
  },
  {
    title: "พ่อครัวฝึกหัดกับคาจิกิอาหารศักดิ์สิทธิ์ เล่ม 2",
    author: "SUZUKI SANAMI",
    publisher: "สยามอินเตอร์คอมิกส์/Siam Inter Comics",
    description:
      "   การมาเยือนของพายุ เพราะคาจิกิที่เป็นดั่งภัยพิบัติ ซินไคเกียว ได้คืบคลานเข้ามาใกล้อิซึซีที่พยายามหลอกล่อซินไคเกียวหมึกยักษ์ออกห่างจากบ้านเรือนของผู้คนด้วยหุ่นเซิดโทยะที่เป็นกำลังหนุนให้อิซีซีและอิซะที่อยากเป็นกำลังให้กับโทยะได้ร้องขอความช่วยเหลือกับสึคุโมะกามิที่สถิตในแขนเทียม!?การต่อสู้เพื่ออาหารรสเลิศแบบฉบับญี่ปุ่นเล่มที่ 2!",
    image: "./img/beer6.jpg",
    price: 85.5,
  },
  {
    title: "กับข้าวกับแขก สำรับอาหารเหนือ",
    author: "คำ ผกา(ลักขณา บันวิชัย)",
    publisher: "แม็กพาย บุ๊กส์",
    description:
      "   หนังสือเกี่ยวกับอาหารเล่มล่าสุดของคำ ผกา ที่จะมาบอกเคล็ดลับการทำอาหารเหนือที่ทุกคนสามารถทำตามได้ง่ายๆ ตั้งเเต่การจ่ายตลาดเลือกวัตถุดิบจนไปถึงตั้งหม้อทำเเกงฮังเลตอนที่ได้รู้ว่าจะได้วาดภาพให้หนังสือเล่มนี้ สิ่งแรกคือการอ่านต้นฉบับ อ่านไปท้องร้องไปเเละต้องเสิร์จ google ดูหน้าตาวัตถุดิบที่ใช้ทำไปด้วย วิ่งไปถามเเม่ก็มีว่านี้คือผักอะไร เพื่อดูว่าหน้าตาเป็นยังไงจะได้วาดถูก เราชอบไปตลาดเช้ากับแม่ ซึ่งก็ทำให้การไปตลาดสดต่างไปจากเดิมเมื่อได้ทำหนังสือเล่มนี้ ทำให้เราสังเกตผักหน้าตาแปลกๆ แอบถ่ายรูปเก็บข้อมูลไว้ก็มี เเละซื้อมาทำอาหารตามที่พี่แขกเขียนด้วย",
    image: "./img/beer7.jpg",
    price: 246.5,
  },
  {
    title: "อร่อยทุกมื้อกับอาหารฟิวชั่น",
    author: "กองบรรณาธิการแสงแดด",
    publisher: "แสงแดด/sangdad",
    description:
      "การได้เริ่มต้นวันใหม่ด้วยมื้ออาหารแสนอร่อยนับเป็นสิ่งดีเพราะช่วยเติมพลังให้กับชีวิตได้ตลอดวัน อาหารมื้อเช้า กลางวันและเย็น จึงกลายเป็นสิ่งจำเป็นยิ่ง หลายคนวางแผนไว้ล่วงหน้าว่าพรุ่งนี้จะทำอะไรกินเป็นมื้อใด บ้างก็นึกไม่ออกว่าจะกินอะไรดี นี่เองที่เป็นโจทย์ให้เหล่าแม่บ้านพ่อบ้านต้องสรรหาเมนูอร่อย ปรุงง่าย กินอิ่มเหมาะกับความต้องการของผู้กินในแต่ละมื้อ นับตั้งแต่มื้อเช้าซึ่งนักโภชนาการเน้นย้ำนักหนาว่าเป็นมื้อสำคัญ คำกล่าวที่ว่า มื้อเข้าให้กินอย่างพระราชา มื้อเที่ยงกินอย่างขุนนาง มื้อค่ำกินอย่างยาจก กลายเป็นแบบแผนปฏิบัติของหลาย ๆคน ทว่า ในยุคสมัยแห่งความเร่งรีบ ทำให้มีเวลาตระเตรียมอาหารมื้อเข้าได้ไม่ทันกาล หลายคนจึงจำใจเลือกฝากท้องไว้กับร้านข้าวแกง อาหารจานด่วน หรืออาหารสำเร็จรูปในร้านสะดวกซื้อ แต่แท้จริงแล้ว การได้ตื่นแต่เข้ามาเตรียมทำอาหารง่าย ๆเอาไว้กินรองท้องก็นับเป็นความสุขไม่น้อย ยิ่งกว่านั้นยังช่วยประหยัดและปลอดภัยกว่าซื้อหามากินอีกต่างหากแม้กระทั่งมื้อกลางวันหรือมื้อเย็นก็กลายเป็นอีกมื้อหนึ่งที่ผู้มีเวลาน้อยต่างแอบถอดใจ หากต้องลงมือปรุงอาหารด้วยตัวเอง แต่ไม่ว่ามื้อไหน ๆสำหรับผู้รักการทำอาหาร ย่อมอยากรังสรรค์เมนูใหม่ ๆมาจัดเสิร์ฟบนโต๊ะ แม้เงื่อนไขเวลาจะมีอยู่อย่างจำกัด หากได้เมนูที่หาวัตถุดิบไม่ยาก ปรงง่าย และถูกปากถูกใจทุกคนในครอบครัวก็นับเป็นสิ่งดี ดังเมนูมื้ออร่อยกับอาหารฟิวชั่นที่คัดสรรสูตรอาหารนานาชนิด เหมาะกับมื้ออาหารในแต่ละมื้อและเข้ากันได้ดีกับยุคสมัย",
    image: "./img/beer8.jpg",
    price: 174.25,
  },
  {
    title: "รุริและดินแดนอาหารมหัศจรรย์ ล.2",
    author: "KIKUCHI SHOUTA",
    publisher: "สยามอินเตอร์คอมิกส์/Siam Inter Comics",
    description:
      "คำร่ำลือว่าเป็นสมบัติแห่งชาตที่อันตรายสุดในโลก เนี่ยไม่ใช่คำพูดลอยๆ เลยโชคดีจริงๆ ที่ได้กลับมาอย่างปลอดภัย...ถึงขนาดชวนให้คิดอย่างนั้นไม่มีพาวเวอร์สปอร์ตที่ไหนแล้วจะเหนือไปกว่าที่นี่คิคูจิ โขตะ",
    image: "./img/beer9.jpg",
    price: 85.5,
  },
  {
    title: "มหัศจรรย์มื้ออาหารร้านก็อบลิน เล่ม 1",
    author: "คิมยงเซ กับ คิมบย็องซ็อบ",
    publisher: " นานมีบุ๊คส์/nanmeebooks",
    description:
      "ร้านอาหารมหัศจรรย์เปี่ยมมนตร์ขลัง สะดุดตากับป้ายร้านสีทองตวัดลายพู่กันอักษรสีดำ ผนังสีแดงลายก็อบลินน่าเกรงขามและมีเจ้าของร้านสาวสุดลึกลับ โทฮวารัง คอยต้อนรับผู้มาเยือนในชุดฮันบกอย่างอบอุ่น!?แม้รายการอาหารจะเต็มไปด้วยชื่อรสชาติแปลกตา ซ้ำยังเต็มไปด้วยกรรมวิธีที่น่าประหลาดใจ แต่อาหารวิเศษเหล่านั้นกลับมีรสชาติที่ลึกล้ำเกินบรรยาย เจ้าของร้านผู้นี้ขอรับค่าอาหารเป็นเส้นผมเพียงเส้นเดียวเท่านั้น และหลังจากผู้มาเยือนรับประทานไปแล้วอีกไม่นานเรื่องมหัศจรรย์ทั้งหลายก็จะตามมาวรรณกรรมสั้นส่งเสริมการอ่านจากประเทศเกาหลีกับเรื่องราวสุดสนุก แฝงข้อคิด พร้อมภาพประกอบสี่สีที่เสริมความเพลิดเพลินในการอ่านให้อร่อยมากยิ่งขึ้น ก็อบลินสาวโทฮวารังพร้อมเสิร์ฟความอร่อยแสนวิเศษให้ผู้มีทุกข์ทุกท่านได้ลิ้มรสแล้ว!",
    image: "./img/beer10.jpg",
    price: 174.25,
  },
];

const bookContainer = document.getElementById("book-container");
bookContainer.innerHTML = book
  .map(
    (item, index) => `
    <div key="${index}" class="border rounded-lg shadow-lg bg-white px-4 py-2 h-full flex flex-col justify-between mx-auto max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg">
        <div class="flex justify-center">
            <img class="object-cover w-32 h-40 sm:w-40 sm:h-52 md:w-48 md:h-60 rounded-lg mb-4" src="${
              item.image
            }" alt="${item.title}">
        </div>
        <div class="px-2 ">
            <p class="text-primary font-bold text-md sm:text-lg mb-1 hover:underline cursor-pointer" onclick="showDetails(${index})">${
      item.title
    }</p>
            <p class="text-xs sm:text-sm text-gray-600 mb-2">${item.author}</p>
            <p class="text-gray-800 text-xs sm:text-sm mb-2">${item.description.slice(
              0,
              60
            )}...</p>
            <div class="flex items-center mb-2">
                <i class="ri-star-fill text-yellow-500"></i>
                <p class="text-primary text-xs sm:text-sm ml-2">(${
                  item.rating
                })</p>
            </div>
            <p class="text-primary font-semibold text-sm sm:text-lg mb-2">ราคา ${
              item.price
            } บาท</p>
        </div>
        <div class="flex flex-col space-y-2">
            <div class="flex justify-center space-x-2 mt-2">
                <button 
                onclick="addToCart(${index})"
                class="bg-primary text-white rounded-full px-2 sm:px-3 py-1 sm:py-2 text-xs sm:text-sm flex items-center hover:bg-purple-700 transition-colors duration-200">
                    <i class="ri-shopping-cart-fill mr-1"></i> เพิ่มลงตะกร้า
                </button>
                <div class="flex items-center cursor-pointer text-primary hover:text-red-500 transition-colors duration-200">
                    <i class="ri-heart-line text-base sm:text-lg mr-1"></i>
                    <p class="text-xs sm:text-sm">เพิ่มลงรายการโปรด</p>
                </div>
            </div>
        </div>
    </div>
`
  )
  .join("");

function showDetails(index) {
  const bookDetail = book[index];

  const params = new URLSearchParams({
    title: bookDetail.title,
    author: bookDetail.author,
    publisher: bookDetail.publisher,
    description: bookDetail.description,
    image: bookDetail.image,
    price: bookDetail.price,
  });
  const Url = `detail.html?${params}`;
  window.location.href = Url;
}

function addToCart(index) {
  const cartBook = book[index];
  let cart = JSON.parse(localStorage.getItem("cart")) || [];
  cart.push(cartBook);
  localStorage.setItem("cart", JSON.stringify(cart));
  alert("Cart added successfully!");
}
