const book = [
  {
    title: "ชีวิตนี้ใช้ให้คุ้มได้อีก ได้อีก ได้อีก",
    author: "Park Makrye และ Kim Yura",
    publisher: " Bloom",
    description:
      "  ใครจะไปคิดว่าวันหนึ่งคุณย่าพัคมักเรวัย 71 ปีที่ใช้ชีวิตแสนจะธรรมดาจะมีโอกาสบินข้ามน้ำข้ามทะเลจากเกาหลีไปกระทบไหล่ซีอีโอกูเกิลและยูทูบที่อเมริกา!โลกนี้มีเรื่องสนุกๆให้ทำอีกตั้งเยอะ อย่ามัวแต่กังวลถึงวันพรุ่งนี้จนไม่ได้ทำส่งที่อยากทำไม่ต้องรอให้อายุ 71 ปีเท่าคุณย่าพัคมักเรหรอก ออกไปตะลุยโลกกว้างตั้งแต่วันนี้แล้วใช้ชีวิตให้คุ้มกันเถอะ!",
    image: "./image/1.jpg",
    price: 265.5,
  },
  {
    title: "Mission To Top U ภารกิจพิชิต Top University",
    author: "เมฆ ระดมเลิศ อนันตชินะ",
    publisher: "วิช",
    description:
      "1.ทำไมต้อง Top U 2 เรียน Top U ต่างประเทศค่าเทอมเท่าไหร่ คุ้มเงินลงทุนมั้ย? 3 ไม่มีเงิน ยังไปเรียนได้มั้ย? ทุนเรียนฟรีมีมั้ย? 4 เลือก Program ไหนดี? ไปประเทศไหนดี? 5 มหาวิทยาลัยที่เป็น Top U มองหาคุณสมบัติแบบไหนจากผู้สมัคร 6 เลือก Top U ถูกที่ พาเราไปถึงเป้าหมาย",
    image: "./image/2.jpg",
    price: 260.1,
  },
  {
    title: "สำเร็จนอกกรอบ",
    author: "วีรวัฒน์ วลัยเสถียร",
    publisher: "FreeMind ฟรีมายด์",
    description:
      "เรื่องราวและประสบการณ์ชีวิต ของ 'ดิว - วีรวัฒน์ วลัยเสถียร' กว่าจะมาถึงวันนี้ กับสมญานามที่ใครต่อใครต่างเรียกเขาว่า 'เศรษฐีหมื่นล้าน' บทเรียนชีวิตที่เต็มไปด้วยสีสัน และครบทุกรสชาติกว่าจะประสบความสำเร็จได้อย่างทุกวันนี้ สิ่งสำคัญที่เขามีไม่เคยขาด คือการมีวินัยในการใช้ชีวิต ควบคู่ไปกับการมีวินัยทางการเงิน ความมุ่งมั่นและความชัดเจนในเป้าหมายชีวิต คือความสำเร็จนอกกรอบในวิถีของคุณดิว ที่อยากส่งต่อถึงผู้อ่านทุกคนว่า อย่าให้ใครมาตีกรอบความสำเร็จของคุณ จงหาเป้าหมายของตัวเองให้เจอและไปให้ถึงด้วยวินัยตน โดยมีประสบการณ์ของคุณดิวที่สามารถนำไปปรับประยุกต์ใช้ เพื่อให้ไปถึงเป้าหมายได้เร็วขึ้น มั่นคงขึ้น",
    image: "./image/3.jpg",
    price: 225.0,
  },
  {
    title:
      "คนแปลกหน้าชื่อว่าตัวเอง : บันทึกจากตัวตนอันแตกร้าว และสิ่งแปลกปลอมที่หลอมเป็นตัวเรา",
    author: "Rachel Aviv",
    publisher: "บุ๊คสเคป/BOOKSCAPE",
    description:
      " เราจะตามหาตัวตนเดิมที่ทำหล่นหายเจอได้อย่างไร หากความป่วยทางใจได้เปลี่ยนเนื้อแท้ของเราไปแบบไม่มีวันย้อนคืนเรเชล อาวีฟ นักเขียนสารคดีมือรางวัลแห่ง New Yorker และอดีต “ผู้ป่วยอะนอเร็กเซียที่อายุน้อยที่สุดในสหรัฐฯ” กอดเก็บประสบการณ์เจ็บปวดในวัยเยาว์ แล้วออกเดินทางไปสำรวจเรื่องราวจากเหล่า “คนแปลกหน้า” ผู้หลงลืมตัวตนและหลงทางในโลกแห่งจิตเวช กลั่นกรองเป็นบันทึกความเจ็บป่วยทางจิตและประวัติศาสตร์บาดแผลทางใจที่ได้รับเสียงชื่นชมทั่วโลก พร้อมชวนตั้งคำถามถึงความไม่ลงรอยระหว่าง “คำวินิจฉัย” อันมีกรอบเกณฑ์ กับ “ตัวตน” ของผู้ป่วยที่มีเลือดเนื้อจิตใจ หมอหนุ่มซึมเศร้าผู้เชื่อว่าการรักษาแบบจิตวิเคราะห์ทำชีวิตตนพังหญิงจิตเภทชาวอินเดียผู้สวามิภักดิ์กายใจต่อพระกฤษณะ แต่ไม่เคยมีใครคิดว่านั่นคือหนทางเยียวยาเธอ คุณแม่ผิวดำกับอาการจิตหลงผิดในสังคมคนขาวที่ “ไม่มีใครฟังเสียงฉันเลย”เด็กสาวไบโพลาร์ที่เชื่อคำวินิจฉัยแพทย์และพึ่งยาสารพัดมาตลอดชีวิต จนไม่รู้จักตัวเองอีกต่อไปหนังสือเล่มนี้ไม่ใช่เพียงเรื่องราวการต่อสู้ของผู้ป่วย แต่คือบันทึกการเดินทางอันอบอุ่นและกล้าหาญของมนุษย์ผู้มีหัวใจและไม่เคยยอมแพ้ พร้อมหยัดยืนอยู่เป็นเพื่อนเคียงข้างโดยไม่ตัดสิน และท้าทายให้เราขยายพรมแดนโลกจิตเวชไปอีกขั้น เพื่อโอบกอด คนแปลกหน้าชื่อว่าตัวเอง ที่อาจซ่อนอยู่ในตัวคุณ ฉัน หรือเราทุกคน",
    image: "./image/4.jpg",
    price: 315.0,
  },
  {
    title: "จะกินพุดดิ้งชิ้นนี้เลยไหมหรือจะทนไว้ก่อน",
    author: "คาคิอุจิ ทาคาฟุมิ",
    publisher: "อมรินทร์ How to",
    description:
      "  90% ของเวลาในชีวิตเป็นเรื่องของการตัดสินใจแต่ก็คงมีหลายครั้งที่คุณตัดสินใจเลือกไม่ถูกใช่ไหมว่า…จะกินพุดดิ้งตอนนี้ หรือ ไปออกกำลังกายดีนะจะทำงานในบริษัทเดิมต่อไป หรือ จะลองเปลี่ยนงานใหม่จะอ่านหนังสือสอบให้จบ หรือ ดูซีรีส์คลายเครียดก่อนชีวิตเราทุกคนประกอบด้วย “เวลา 4 ประเภท” ได้แก่ เวลาแห่งความสุข เวลาสำหรับการลงทุน เวลาที่เป็นบทบาทหน้าที่ และ เวลาที่ใช้ไปอย่างเปล่าประโยชน์หนังสือเล่มนี้จะแนะนำว่า เราควรเลือกใช้เวลาแต่ละประเภทอย่างไร เพื่อจะได้มีชีวิตอย่างที่ต้องการ และไม่ต้องมานึกเสียใจภายหลัง",
    image: "./image/5.jpg",
    price: 233.75,
  },
  {
    title: "ไม่ต้องได้ทุกอย่างเพื่อมีความสุข (JOMO)",
    author: "ธนา เธียรอัจฉริยะ",
    publisher: "คู้บ/KOOB",
    description:
      ' ไม่เป็นไรหรอกที่คนเราจะสลับไปสลับมาระหว่าง "สำเร็จ" บ้าง "ล้มเหลว" บ้าง เก่งตลอดเวลาชีวิตคงน่าเบื่อแย่ 50 ทัศนคติจากประสบการณ์ชีวิตของผู้คนหลากหลาย ที่จะทำให้คุณกล้าโอบรับความพลาดพลั้ง พ่ายแพ้ ล้มเหลว แถมยังไม่หวั่นไหวไปกับกระแสธารที่พยายามเร่งเร้าให้เราต้อง "ได้" และ "เป็น" ทุกอย่าง พลิกผ่านไปทีละหน้า คุณจะค่อยๆ วางใจในโชคชะตา และเริ่มรู้สึกมากขึ้นเรื่อยๆ ว่า...ไม่ต้องได้ทุกอย่างเพื่อมีความสุข',
    image: "./image/6.jpg",
    price: 296.1,
  },
  {
    title: "วิชาเลิกเงียบ",
    author: "Elaine Lin Hering",
    publisher: "แคนตัส พับลิชชิ่ง/Cactus Publishing",
    description:
      "น่าอึดอัดเหมือนกันนะ เวลาที่อยากพูดออกไปเพื่อปกป้องตัวเองแต่ขณะเดียวกันก็กลัวว่าพูดแล้วจะโดนอะไรกลับมาอิสระในการพูดตามที่ตัวเราคิดจริงๆ คือสิทธิ์พิเศษที่ไม่ได้จะมีกันทุกคนอาจมีบางครั้งที่มีคนบอกให้คุณพูดออกมาอย่างใจคิดแต่พอพูดจริงๆ กลับไม่มีใครฟัง หรือถึงขั้นโดนตำหนิมีบางคนใช่ไหมที่คุณรู้สึกว่าอยู่ด้วยแล้วแสนจะทรมานแต่ก็ไม่อาจพูดอะไร และหนีไปไหนก็ไม่ได้ที่จริงแล้วคุณควบคุมได้นะเหมือนเวลาขับรถแล้วต้องเหยียบเบรกกับคันเร่งให้ถูกจังหวะการรู้ว่าเมื่อใดต้องเงียบ เมื่อใดต้องพูด และต้องพูดอะไร นั่นคือศิลปะคำพูดคือตัวกำหนดว่าเราจะขีดเส้นของความเคารพตัวเองไว้ตรงไหน“แม่คะ หนูคบกับคนนี้ดีไหม” VS “แม่คะ หนูจะลองคบกับคนนี้ดู แม่มีอะไรแนะนำไหม”สองประโยคนี้ทำให้ตำแหน่งและพลังของคุณแตกต่างกัน ซึ่งมันสำคัญมากต่อการสร้างและรักษาคุณค่าของตัวเองทั้งการเงียบและการพูดนั้นคืออาวุธเหมือนสุภาษิต คำพูดมีค่าดุจเงิน ความเงียบมีค่าดั่งทองหนังสือมากมายหลายเล่มสอนให้เรารู้จักพูด แต่นี่คือเล่มแรกที่จะสอนให้เรารู้จักเงียบ",
    image: "./image/7.jpg",
    price: 305.1,
  },
  {
    title: "Only Time Will Tell (New Edition)",
    author: "วิไลรัตน์ เอมเอี่ยม",
    publisher: "DOT",
    description:
      "เพราะชีวิตที่แท้จริงของคนเราก็คือการได้ใช้ชีวิตในจุดที่เหมาะสมกับความเป็นตัวเรามากเท่าที่เราเป็น ไกลเท่าที่เราเอื้อมถึง และไม่หนักหนาเกินกว่าที่เราจะแบกรับไหวอะไรที่มากเกินกว่านั้น นับว่าเป็นภาระมากกว่าจะเรียกว่าการใช้ชีวิต",
    image: "./image/8.jpg",
    price: 315.0,
  },
  {
    title: "กลยุทธ์จิตวิทยาเหนือชั้นของโจโจ้",
    author: "โยชิฮิโตะ ไนโต",
    publisher: "วารา",
    description:
      'การวิเคราะห์เรื่องราวจากการ์ตูนยอดฮิตของญี่ปุ่นที่มียอดขายกว่า 100 ล้านเล่ม "โจโจ้ ล่าข้ามศตวรรษ"หนังสือแห่งความประทับใจ ร่วมถึงตัวผู้เขียน ถ่ายทอดออกมาเป็นกลยุทย์ทางจิตวิทยาอันเหนือชั้นเล่มนี้ เรื่องราวการผจญภัยของโจโจ้ได้ส่งต่อการเอาชนะ และการตั้งรับกับเหล่าตัวร้ายมากมาย และพวกเขาไม่เคยแพ้ อะไรคือเทคนิคที่พวกคุณยังไม่รู้ และสุดยอดขนาดไหน มาเริ่มการผจญภัยนี้กันเลยเปลี่ยนตัวเองเพื่อนโน้มน้าวคนอื่น คือเปลี่ยนกลยุทธ์ทางจิตวิทยาให้กลายเป็นจริง',
    image: "./image/9.jpg",
    price: 315.0,
  },
  {
    title: "คนที่ประสบความสำเร็จที่สุด เขาไหว้เจ้ากันที่ไหน",
    author: "หนุ่ม (คงกระพัน แสงสุริยะ)",
    publisher: "วีเลิร์น (WeLearn)",
    description:
      "  คนที่ประสบ ความสำเร็จที่สุด เขาไหว้เจ้า กันที่ไหน25 Secret Places to Find Your Success  ง่ายดาย ราบรื่น คิดทำสิ่งใดก็สำเร็จลุล่วง นี่ไม่ใช่แค่คำอธิษฐาน แต่เป็นสิ่งที่เกิดขึ้นจริงและเกิดขึ้นซ้ำ ๆ กับคนบางกลุ่ม คนที่ประสบความสำเร็จที่สุดต่างรู้ดีว่า นอกจากความสามารถแลความพยายามแล้ว “โชค” ยังมีผลต่อความสำเร็จอย่างมาก ดังคำกล่าวที่ว่า “แค่เก่งอย่างเดียวไม่พอ แต่ต้องเฮงด้วย” แล้วพวกเขาเรียกโชคเข้ามาในชีวิตอย่างไร? หนังสือเล่มนี้จะพาคุณไปสำรวจ 25 สถานที่ ซึ่งบรรดาคนที่ประสบความสำเร็จที่สุดเดินทางไปกราบไหว้ขอพรกัน ไม่ว่าจะเป็นนักธุรกิจชั้นแนวหน้า มหาเศรษฐี หรือศิลปินชื่อดัง พร้อมเทคนิคและเคล็ดลับที่จะช่วยให้คำขอของคุณสมปรารถนา ทั้งเรื่องธุรกิจ การงาน โชคลาภ ชีวิตที่ราบรื่น และสุขภาพที่แข็งแรง แนะนำจากประสบการณ์ตรงของ หนุ่ม – คงกระพัน แสงสุริยะ เจ้าของช่อง YouTube “หนุ่มคงกระพัน official” ที่มียอดผู้ติดตามมากกว่า 3 ล้านคน",
    image: "./image/10.jpg",
    price: 315.0,
  },
];

const bookContainer = document.getElementById("book-container");
bookContainer.innerHTML = book
  .map(
    (item, index) => `
    <div key="${index}" class="border rounded-lg shadow-lg bg-white px-4 py-2 h-full flex flex-col justify-between mx-auto max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg">
        <div class="flex justify-center">
            <img class="object-cover w-32 h-40 sm:w-40 sm:h-52 md:w-48 md:h-60 rounded-lg mb-4" src="${
              item.image
            }" alt="${item.title}">
        </div>
        <div class="px-2 ">
            <p class="text-primary font-bold text-md sm:text-lg mb-1 hover:underline cursor-pointer" onclick="showDetails(${index})">${
      item.title
    }</p>
            <p class="text-xs sm:text-sm text-gray-600 mb-2">${item.author}</p>
            <p class="text-gray-800 text-xs sm:text-sm mb-2">${item.description.slice(
              0,
              60
            )}...</p>
            <div class="flex items-center mb-2">
                <i class="ri-star-fill text-yellow-500"></i>
                <p class="text-primary text-xs sm:text-sm ml-2">(${
                  item.rating
                })</p>
            </div>
            <p class="text-primary font-semibold text-sm sm:text-lg mb-2">ราคา ${
              item.price
            } บาท</p>
        </div>
        <div class="flex flex-col space-y-2">
            <div class="flex justify-center space-x-2 mt-2">
                <button 
                onclick="addToCart(${index})"
                class="bg-primary text-white rounded-full px-2 sm:px-3 py-1 sm:py-2 text-xs sm:text-sm flex items-center hover:bg-purple-700 transition-colors duration-200">
                    <i class="ri-shopping-cart-fill mr-1"></i> เพิ่มลงตะกร้า
                </button>
                <div class="flex items-center cursor-pointer text-primary hover:text-red-500 transition-colors duration-200">
                    <i class="ri-heart-line text-base sm:text-lg mr-1"></i>
                    <p class="text-xs sm:text-sm">เพิ่มลงรายการโปรด</p>
                </div>
            </div>
        </div>
    </div>
`
  )
  .join("");

function showDetails(index) {
  const bookDetail = book[index];

  const params = new URLSearchParams({
    title: bookDetail.title,
    author: bookDetail.author,
    publisher: bookDetail.publisher,
    description: bookDetail.description,
    image: bookDetail.image,
    price: bookDetail.price,
  });
  const Url = `detail.html?${params}`;
  window.location.href = Url;
}