const book = [
    {
        title : "High school detective คู่ป่วนปริศนาไขคดีฆาตกรรม",
        autohor : "K.Tears",
        publisher : "อาเธน่า",
        description : "High school detective คู่ป่วนปริศนาไขคดีฆาตรกรรมแค่มีดวงตาที่มองเห็นสีสันต่างๆ จากตัวผู้คนได้ อคิราห์ ผู้มีนิสัยรักสงบเหมือนแม่บ้านวัยเกษียณก็คิดว่านั่นเป็นเรื่องยุ่งยากน่ารำคาญมากพออยู่แล้ว เมื่อตอนต้นเทอมเขาดันตัดสินใจผิดพลาดอย่างมหันต์ด้วยการยื่นใบสมัครเข้าชมรมวิจัยทางทะเลอย่างไม่ตั้งใจห้องชมรมบนดาดฟ้าตึกที่นอกจากจะร้อนตับแตกแล้ว หลอดไฟในห้องดวงเดียวก็ยังเสีย แต่ก็ไม่ร้ายเท้าหัวหน้าชมรมแปลกประหลาด อธิษฐาน ผู้มีผิวขาวซูบซีด และไม่เคยไปเหยียบทะเลมาก่อนเลยในชีวิต เขาก้าวเข้ามาทำให้ชีวิตของเด็กหนุ่มผู้รักความสงบ และเกลียดความวุ่นวายเข้าไส้อย่างยิ่งใกล้เคียงกับคำว่า หายนะความสัมพันธ์ที่ไม่ใช่ทั้งเพื่อนและคนรู้จัก ทว่าเด็กหนุ่มทั้งสองกลับโคจรอยู่รอบตัวของกันและกันราวกับถูกผูกตรึงเอาไว้ด้วยโซ่ตรวนอันลึกลับซับซ้อนของคดีฆาตกรรม ชะตากรรมที่หมุนวนนำพา อคิราห์ ผู้มีความสามารถประหลาดมาพบกับ อธิษฐาน เด็กหนุ่มผู้ก่อตั้งชมรมวิจัยทางทะเลวันและคืนที่เต็มไปด้วยสีสันแห่งปริศนาได้เริ่มต้นขึ้นแล้ว...",
        image : "./img/s.jpg",
        price : "280"
    },

    {
        title : "High School Detective คู่ป่วนไขปริศนาคดีฆาตรกรรม เล่ม 2",
        autohor : "K.Tears",
        publisher : "อาเธน่า",
        description : "หลังจากผ่านช่วงเวลาที่แสนวุ่นวายในรั้วโรงเรียน‘อคิราห์” เด็กหนุ่มมัธยมปลายผู้มองเห็นอารมณ์ของผู้คน เป็นสีสันต่างๆ ได้เข้าสู่ช่วงปิดเทอมที่แสนสงบสุขในที่สุดจนกระทั่งประตูบ้านสองชั้นสีขาวอันร่มรื่นของเขาถูกบุกรุกโดยนายตํารวจไฟแรง ผู้เป็นทั้งลุงที่เป็นญาติสนิทเพียงคนเดียวพ่วงตําแหน่งเจ้ากรรมนายเวรที่นําพาปัญหาอันไม่จบสิ้นมาสู่ชีวิต ที่ห่างไกลจากคําว่าเรียบง่ายอยู่แล้วให้ห่างไกลเข้าไปอีกโดยต้นเหตุครั้งนี้คือ จดหมายปริศนาที่สืบเนื่องมาจากคดีในอดีตปริศนาอันยุ่งเหยิงจากจดหมายลึกลับทําให้อคิราห์ต้องพบกับคู่หูเก่าที่ไม่อยากเจอหน้ามากที่สุดอย่าง ‘อธิษฐาน’ตัวป่วนผู้มีรสนิยมการใช้ชีวิตอันน่าอัศจรรย์อัจฉริยะผู้สอบตกกราวรูด แต่ช่ําชองในปริศนาฆาตกรรม เด็กหนุ่มผู้ก่อตั้งชมรมวิจัยทางทะเล ที่ชั่วชีวิตไม่เคยเห็นทะเลสีสันแห่งคดีฆาตกรรมหมุนวนรอบตัวอีกครั้ง ดึงรั้งเด็กหนุ่มทั้งสองให้โลดแล่นสู่โลกแห่งปริศนาอันซับซ้อนไปด้วยกัน",
        image : "./img/1000276687_front_XXXL.jpg",
        price : "280"
    },
    {
        title : "เจโตพิสดารธาตุ",
        autohor : "ศิวา สืบวงศ์สิน",
        publisher : " กาฬกาล GALAgAAN",
        description : "  “พิสดารธาตุ” ศาสตร์ลึกลับสมัยขอมโบราณที่สาบสูญจากการสืบทอดมาหลายร้อยปี กลับถูกค้นพบและนำมาสร้างมนุษย์พิเศษบางคน เพื่อภารกิจลับอันมีเป้าหมายใหญ่หลวงสะท้านฟ้าสะเทือนดิน พันตรีศิลา หนึ่งในผู้ถูกปลุกพิสดารธาตุขึ้นมาจนเป็นมนุษย์พิเศษ เขารับรู้ความไม่ปกติจนต้องดิ้นรนเอาตัวรอดจากบ่วงที่ร้อยรัดตัวเขาเข้าไปทุกที และพยายามย้อนกลับไปเปิดโปงจุดมุ่งหมายของขบวนการในเงามืดนั้น”",
        image : "./img/aa.jpg",
        price : "349"
    },
    {
        title : "รากษสโฮเต็ล",
        autohor : "สุธี ปิงสุทธิวงศ์",
        publisher : "กาฬกาล GALAgAAN",
        description : "“ส่วนผสมคนละขั้วระหว่าง ความเป็นหนุ่มนักเรียนนอกทำงานบริษัทฝรั่ง กับผู้สืบทอดไสยเวทย์ของตระกูล กลับผสมได้อย่างไร้รอยต่อในตัวของหนุ่มหล่ออย่าง ทิม วิทยาคมฆาตกรรมครั้งแล้วครั้งเล่าในรีสอร์ตของหญิงสาวที่เขาหมายปอง ชักนำให้ทิมไปพบกับปริศนาอันมืดมัวว่า เป็นฝีมืออันโหดเหี้ยมของมนุษย์ หรือแรงบันดาลจากปีศาจร้าย แต่นั่นก็ทำให้ทิมเฉียดเข้าใกล้ความตายจนน่าขนลุก”หนังสือที่เกี่ยวข้อง ",
        image : "./img/a.jpg",
        price : "399"
    },
    {
        title : "ศพใต้เตียง",
        autohor : "สรจักร",
        publisher : "prism publishing , ปริซึม",
        description : "    รวมเรื่องสั้นเขย่าขวัญ หักมุม ผสมผสานมุมมองที่สะท้อนความเป็นไปในสังคมอย่างน่าสนใจ ศพใต้เตียง เล่มนี้ สรจักร ถ่ายทอดจินตนาการอันแหลมคมไว้อย่างสุดฝีมือ 19 เรื่องสั้นหักมุม เขย่าขวัญ ฆาตกรรมอำพรางที่สนุกสนาน ระทึกใจ ดึงผู้อ่านสู่โลกจินตนาการอันแปลกไป ขณะเดียวกันก็ฉุกให้ตระหนักถึงผลพวงจากสภาพสั่งคมที่วิกฤติลงทุกที พร้อมกับตั้งคำถามถึงปัญหาทางศีลธรรมไว้ให้ขบคิด ท้ายเรื่องหักมุมอย่างน่ตื่นเต้น เป็นอาชญาหฤหรรษ์ ที่จะทำให้ทุกท่าน ทั้งสนุก ทั้งผวา ในทุกๆ หน้า",
        image : "./img/g.jpg",
        price : "255"
    },
    {
        title : "คดีปริศนากับนัยน์ตาสืบวิญญาณ",
        autohor : "ลอยชาย",
        publisher : "prism publishing , ปริซึม",
        description : "เมื่อตำรวจที่ไขคดีด้วยการมองเห็นวิญญาณ ต้องพบกับคดีที่วิญญาณหายไปจากศพ เขาจะต่อกรกับฆาตกรต่อเนื่องที่เชี่ยวชาญด้านไสยเวทได้อย่างไร หากดวงตาของมนุษย์สามารถรับรู้และมองเห็นในสิ่งที่ไม่ควรเห็นได้จะนำมาซึ่งสิ่งใด และนำพาไปสู่สิ่งใด สิ่งที่เห็นนั้นมีจริงหรือ แล้วที่ไม่เห็นนั้นไม่มีจริงหรือ ใครเล่าจะให้คำตอบเทวกานต์ ได้รับดวงตาที่สามารถมองเห็นสิ่งที่คนทั่วไปมองไม่เห็น บางคนเรียกมันว่า พรสวรรค์ แต่สำหรับเขามันคือ คำสาป คำสาปที่ไม่มีวันเลือนรางจนกว่าเขาจะสิ้นลมหายใจในชาตินี้",
        image : "./img/d.jpg",
        price : "325"
    },
    {
        title : "บ้านซ่อนศพ",
        autohor : "สาววายรำพัน",
        publisher : "SHADOW",
        description : "   โก้ถูกใจวอร์ม เขาจึงพาตัวเองเข้าไปอยู่ใกล้ๆ วอร์ม ตั้งแต่ลงวิชาเลือกเดียวกัน ทำรายงานกลุ่มด้วยกัน หาเรื่องให้อีกฝ่ายช่วยติว และได้รู้โดยบังเอิญว่าตามเนื้อตัวของวอร์มเต็มไปด้วยรอยฟกช้ำดำเขียว แต่วอร์มอ้างว่าตัวเองซุ่มซ่าม โก้ได้เจอกับคุณปัดตอนไปส่งวอร์มที่บ้าน แต่คุณปัดเพียงมองมาจากหน้าต่างชั้นสอง ไม่แม้แต่จะรับไหว้หรือยิ้มให้เมื่อโก้ยกมือไหว้จากในรถ ทั้งคู่สนิทกันมากขึ้นจนวอร์มยอมเปิดใจ แต่ยิ่งสนิทกันมากเท่าไหร่ โก้ก็ยิ่งรู้สึกว่าตัวเองรู้จักวอร์มน้อยลงเรื่อยๆ เพราะทุกคำพูดของวอร์มเป็นเรื่องโกหก ถ้าไม่ได้อ่านไดอะรีที่วอร์มลืมไว้ เขาคงไม่รู้เลยว่าในบ้านหลังคาสีดำหลังสุดท้ายในซอยตันเกิดอะไรขึ้นบ้าง ทั้งมอเตอร์ไซค์วินที่ปีนเข้าไปขโมยของ คุณแป้งลูกสาวคุณปัด และเจ๋ง เพื่อนสนิทของโก้ ต่างก็จบชีวิตในบ้านหลังนั้น... แต่ถึงจะรู้อย่างนั้น โก้ก็ยังอยากช่วยวอร์มให้หลุดพ้นจากเรื่องบ้าๆ พวกนี้ เขาจึงข่มความกลัวแล้วแอบเข้าไปในบ้าน แต่โชคร้าย เขาถูกจับตัวไว้และกำลังจะมีชะตากรรมเดียวกับเจ๋ง ทว่าพี่มุกเข้ามาขัดจังหวะและถูกทำร้ายจนเสียชีวิต โก้หนีรอดไปได้อย่างหวุดหวิดเพราะ ‘คุณปัด’ ที่ทุกคนเข้าใจมาตลอดว่าเป็นคนทำเรื่องเลวร้ายมากมายเข้ามาช่วยไว้ วอร์มจึงได้รู้ในตอนนั้นเองคนที่มือเปื้อนเลือดคือตัวเอง ไม่ใช่คุณปัดที่เป็นมะเร็งระยะสุดท้าย เขายอมกินนมอุ่มผสมยาพิษ วิธีเดียวกับที่คุณปัดใช้จบชีวิตคุณแป้งที่โดนรุมข่มขืนจนสติไม่ดี เมื่อโก้ย้อนกลับมาก็สายไปแล้ว เจอเพียงร่างที่ไร้ลมหายใจของวอร์ม",
        image : "./img/sa.jpg",
        price : "200"
    },
    {
        title : "โอปปาติกะอำพราง",
        autohor : "กิตติศักดิ์ คงคา",
        publisher : "13357 PUBLISHIHG",
        description : " “อศิ” ผู้ช่วยนักสืบซินแคลร์ได้รับว่าจ้างให้ตามหาคนหายบนพื้นที่หลายพันไร่ เวลาผ่านไปแล้วหลายเดือนจนแทบไม่เหลือความหวังว่าผู้สาบสูญจะยังมีชีวิตอยู่ และผู้ต้องสงสัยอันดับหนึ่งก็เพิ่งป่วยตายไปโดยแทบไม่ทิ้งเบาะแสอะไรไว้ ...รายละเอียดทั้งหมดได้แรงบันดาลใจมาจากคดีอาชญากรรมที่เกิดขึ้นจริงในประเทศไทย ผู้คนสูญหาย ผู้ร้ายป่วยตายอย่างสงบ และเหตุสมโทษทัณฑ์ทั้งหมดนับถอยหลังสู่วันสิ้นอายุความ",
        image : "./img/sau.jpg",
        price : "300"
    },
    {
        title : "หนึ่งนัด",
        autohor : "ชัยกร หาญไฟฟ้า",
        publisher : "แพรวสำนักพิมพ์",
        description : "นวนิยายเข้ารอบสุดท้ายรางวัลนายอินทร์อะวอร์ด แนวสืบสวนสอบสวน ประจำปีพุทธศักราช 2557 เรื่องราวสุดเข้มข้นซับซ้อนสุดหยั่ง ตั้งแต่ตัวอักษรแรกยันตัวอักษรสุดท้าย ถ่ายทอดชีวิตตลอดจนวิธีคิดของ ''เพชฌฆาตหนึ่งนัด'' ได้ละเอียดลึกซึ้งราวกับตัวผู้เขียนเป็นมือแม่นปืนเสียเอง กอปรกับมุมมองฉากเปิดเรื่องที่สะท้อนผ่านสายตาหลายตัวละครได้อย่างมีมิติราวภาพยนตร์ อยากให้คุณลองอ่านผลงานแนวสืบสวนสอบสวนฝีมือคนไทยเล่มนี้ดูเถิด ไม่ธรรมดาจริงๆ",
        image : "./img/j.jpg",
        price : "135"
    },
    {
        title : "นกก้อนหิน",
        autohor : "บินหลา สันกาลาคีรี",
        publisher : "banglumpoo",
        description : "นกก้อนหิน หนุ่มสาว พวกเธอเชื่อจริงหรือว่าเข้าใจคำว่ารักแท้จริงความรักนั้นเปี่ยมสุข ความรักนั้นเป็นนิรันดร์ ความรักอยู่เหนือทุกสิ่ง เคยสงสัยไหม ทำไมหลายครั้งความรักถึงนำไปสู่ความเจ็บปวด ทำไมหลายครั้งความรักถึงเต็มไปด้วยความผิดหวัง เคยสงสัยไหมว่าถึงอย่างนั้นแล้ว ทำไมเราถึงยังรัก....?ชายหนุ่มเงียบขรึมช่างทำรองเท้าหนังแห่งอำเภอห่างไกลและหญิงสาวเมืองกรุง ที่ต้องผจญภัยร่วมกันในพื้นที่อันตรายแต่มีผู้หญิงอีกคนรออยู่ในใจของเค้า นิยายไม่สดใส ในใจใครหลายคน",
        image : "./img/o.jpg",
        price : "350"
    },
];

const bookContainer = document.getElementById("book-container");
bookContainer.innerHTML = book
  .map(
    (item, index) => `
    <div key="${index}" class="border rounded-lg shadow-lg bg-white px-4 py-2 h-full flex flex-col justify-between mx-auto max-w-xs sm:max-w-sm md:max-w-md lg:max-w-lg">
        <div class="flex justify-center">
            <img class="object-cover w-32 h-40 sm:w-40 sm:h-52 md:w-48 md:h-60 rounded-lg mb-4" src="${
              item.image
            }" alt="${item.title}">
        </div>
        <div class="px-2 ">
            <p class="text-primary font-bold text-md sm:text-lg mb-1 hover:underline cursor-pointer" onclick="showDetails(${index})">${
      item.title
    }</p>
            <p class="text-xs sm:text-sm text-gray-600 mb-2">${item.author}</p>
            <p class="text-gray-800 text-xs sm:text-sm mb-2">${item.description.slice(
              0,
              60
            )}...</p>
            <div class="flex items-center mb-2">
                <i class="ri-star-fill text-yellow-500"></i>
                <p class="text-primary text-xs sm:text-sm ml-2">(${
                  item.rating
                })</p>
            </div>
            <p class="text-primary font-semibold text-sm sm:text-lg mb-2">ราคา ${
              item.price
            } บาท</p>
        </div>
        <div class="flex flex-col space-y-2">
            <div class="flex justify-center space-x-2 mt-2">
                <button 
                onclick="addToCart(${index})"
                class="bg-primary text-white rounded-full px-2 sm:px-3 py-1 sm:py-2 text-xs sm:text-sm flex items-center hover:bg-purple-700 transition-colors duration-200">
                    <i class="ri-shopping-cart-fill mr-1"></i> เพิ่มลงตะกร้า
                </button>
                <div class="flex items-center cursor-pointer text-primary hover:text-red-500 transition-colors duration-200">
                    <i class="ri-heart-line text-base sm:text-lg mr-1"></i>
                    <p class="text-xs sm:text-sm">เพิ่มลงรายการโปรด</p>
                </div>
            </div>
        </div>
    </div>
`
  )
  .join("");

function showDetails(index) {
  const bookDetail = book[index];

  const params = new URLSearchParams({
    title: bookDetail.title,
    author: bookDetail.author,
    publisher: bookDetail.publisher,
    description: bookDetail.description,
    image: bookDetail.image,
    price: bookDetail.price,
  });
  const Url = `detail.html?${params}`;
  window.location.href = Url;
}